```
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Reading...
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Read complete after 0s [id=8d232a145587e7e891fc7c3dc13630d472810d21]
github_actions_secret.aws_region: Refreshing state... [id=devops-toolkit:AWS_REGION]
module.ecs_service.data.aws_partition.current: Reading...
module.ecs_service.module.container_definition["myapp"].data.aws_region.current: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
data.aws_vpc.default: Reading...
module.ecr.data.aws_partition.current: Reading...
module.ecr.data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecs_service.data.aws_region.current: Reading...
aws_s3_bucket.tf_state: Refreshing state... [id=paulb-devops-toolkit-terraform-state]
module.ecs_service.module.container_definition["myapp"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecr.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]
module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_github_oidc_provider.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.iam_github_oidc_provider.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/ecs-myapp]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=paul-benetis/devops-toolkit]
module.ecs_service.aws_iam_policy.task_exec[0]: Refreshing state... [id=arn:aws:iam::905207152945:policy/myapp-20250529195326312700000001]
module.iam_github_oidc_provider.aws_iam_openid_connect_provider.this[0]: Refreshing state... [id=arn:aws:iam::905207152945:oidc-provider/token.actions.githubusercontent.com]
module.ecs_service.aws_iam_role.task_exec[0]: Refreshing state... [id=myapp-20250529195326312700000002]
module.ecs_service.data.aws_caller_identity.current: Read complete after 1s [id=905207152945]
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=908671369]
module.ecs_service.aws_iam_role.tasks[0]: Refreshing state... [id=myapp-20250529195326316700000004]
module.ecr.data.aws_caller_identity.current: Read complete after 1s [id=905207152945]
data.aws_caller_identity.current: Read complete after 1s [id=905207152945]
module.iam_github_oidc_role.data.aws_partition.current: Reading...
module.iam_github_oidc_role.data.aws_caller_identity.current: Reading...
module.iam_github_oidc_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:905207152945:cluster/ecs-myapp]
module.iam_github_oidc_role.data.aws_caller_identity.current: Read complete after 0s [id=905207152945]
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Reading...
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=898067848]
module.iam_github_oidc_role.aws_iam_role.this[0]: Refreshing state... [id=terraform-20250518221411969600000001]
module.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=paul-benetis/devops-toolkit]
aws_iam_policy.iam_github_oidc_ecr_access: Refreshing state... [id=arn:aws:iam::905207152945:policy/GitHubOIDCECRAccess]
module.ecs_service.aws_iam_role_policy_attachment.task_exec[0]: Refreshing state... [id=myapp-20250529195326312700000002-20250529195327108700000005]
module.ecs_service.aws_ecs_task_definition.this[0]: Refreshing state... [id=myapp]
aws_ecr_repository_policy.allow_pull_push: Refreshing state... [id=paul-benetis/devops-toolkit]
module.iam_github_oidc_role.aws_iam_role_policy_attachment.this["ECRPullPush"]: Refreshing state... [id=terraform-20250518221411969600000001-20250518221412692100000002]
github_actions_secret.iam_github_oidc_role: Refreshing state... [id=devops-toolkit:IAM_GITHUB_OIDC_ROLE]
module.ecr.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2942457173]
module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=paul-benetis/devops-toolkit]
module.ecs.module.cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=ecs-myapp]
module.ecs_service.data.aws_ecs_task_definition.this[0]: Reading...
data.aws_vpc.default: Read complete after 1s [id=vpc-4a5eb237]
data.aws_subnets.default: Reading...
module.ecs_service.data.aws_ecs_task_definition.this[0]: Read complete after 0s [id=arn:aws:ecs:us-east-1:905207152945:task-definition/myapp:2]
data.aws_subnets.default: Read complete after 0s [id=us-east-1]
module.ecs_service.data.aws_subnet.this[0]: Reading...
aws_s3_bucket_versioning.tf_state: Refreshing state... [id=paulb-devops-toolkit-terraform-state]
module.ecs_service.data.aws_subnet.this[0]: Read complete after 1s [id=subnet-b85132f5]
module.ecs_service.aws_security_group.this[0]: Refreshing state... [id=sg-09f6c83040a7468ee]
module.ecs_service.aws_security_group_rule.this["alb_ingress_3000"]: Refreshing state... [id=sgrule-4224863339]
module.ecs_service.aws_security_group_rule.this["egress_all"]: Refreshing state... [id=sgrule-3966004421]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecr_repository_policy.allow_pull_push will be updated in-place
  ~ resource "aws_ecr_repository_policy" "allow_pull_push" {
        id          = "paul-benetis/devops-toolkit"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                            "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                            "ecr:BatchGetImage",
                            # (1 unchanged element hidden)
                        ]
                      ~ Principal = {
                          - AWS = "arn:aws:iam::905207152945:role/terraform-20250518221411969600000001"
                        } -> "*"
                      ~ Sid       = "PrivateReadOnly" -> "AllowPullForAnyone"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action    = [
                          - "ecr:UploadLayerPart",
                            "ecr:PutImage",
                            "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                            "ecr:CompleteLayerUpload",
                        ]
                      ~ Sid       = "ReadWrite" -> "AllowPushForSpecificRole"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.ecs_service.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/ecs-myapp/myapp"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/ecs-myapp/myapp"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "service/ecs-myapp/myapp"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Project" = "devops-toolkit"
        }

      + suspended_state (known after apply)
    }

  # module.ecs_service.aws_ecs_service.ignore_task_definition[0] will be created
  + resource "aws_ecs_service" "ignore_task_definition" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:us-east-1:905207152945:cluster/ecs-myapp"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "myapp"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Project" = "devops-toolkit"
        }
      + task_definition                    = "myapp:2"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-09f6c83040a7468ee",
            ]
          + subnets          = [
              + "subnet-077faf61",
              + "subnet-0b63843a",
              + "subnet-3afd2165",
              + "subnet-9180159f",
              + "subnet-b85132f5",
              + "subnet-de3fe1ff",
            ]
        }

      + timeouts {}
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->